AccumulationRegisters/ОстаткиНаСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСчетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоПереводМеждуСчетами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ДоходыРасходы/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет контроль остатка на счете при проведении
// Предполагается, что движения по регистру "Остатки на счетах" уже записаны
//
// Параметры:
//  Счет - СправочникСсылка.Счета -
//  Период - Дата, Граница -
//  Отказ - Булево -
Процедура ПроверитьОстатокНаСчетеПриПроведении(Счет, Период, Отказ) Экспорт
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДоходыРасходы.ПроверитьОстатокНаСчетеПриПроведении", "Счет", Счет, Тип("СправочникСсылка.Счета"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДоходыРасходы.ПроверитьОстатокНаСчетеПриПроведении", "Период", Период, Новый ОписаниеТипов("Дата, Граница"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДоходыРасходы.ПроверитьОстатокНаСчетеПриПроведении", "Отказ", Отказ, Тип("Булево"));
	
	Остатки = РегистрыНакопления.ОстаткиНаСчетах.Остатки(Период, Новый Структура("Счет", Счет),, "Сумма");
	Если Остатки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Остатки[0].Сумма >= 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Превышен остаток на счете ""%1""'"), Счет));
КонецПроцедуры

#КонецОбласти
